#!/bin/bash
#-------------VARS--------------------------------------------------
WORKERS=$1              # Кол-во параллельных процессов
INT=10.0.0.10           # IP интерфейса тестирования
#-------------------------------------------------------------------
for ((p=1; p<=$WORKERS; p++))
do
PORT=$((13000+$p))                                         # Для каждого процесса свой порт
#CORE=$((2*$p))                                            # Для каждого процесса своё выделенное ядро: -a $CORE
iperf3 -s -B $INT -p $PORT -i 0 -1 -f g &                    # iperf3 server, универсальный для TCP и UDP
done
